[
    {
        "id": "1",
        "userId": "1",
        "body": "One thing I have discovered is that growing your hair is not so much in the products you are using as it is in the technique/s you are using. Are you shocked? Yes, products matter, but that's not the first important thing, at least according to me. You might be using the creme de la creme, but there's not an evidence of your desired goals on your hair. Take a walk with me as I enlighten you..."
    },
    {
        "id": "2",
        "userId": "2",
        "body": "One of the major concerns as we nurture our crowns is the hairline. As you seek to grow your hair healthier and longer, please remember to take care of your edges. Imagine having long beautiful hair but your hairline is seeking higher grounds...LOL! It takes the attention from your hair to the very devastating sight of what's going on around your edges. It may look like a small area but it's a small area with such a big impact. So how do you ensure your edges are flourishing? We'll talk more about that in my next post."
    },
    {
        "id": "3",
        "userId": "2",
        "body": "If you've been folowing my posts, you know what this one will be about. How do you ensure your edges are intact too as you grow your hair? Ensure you are not doing hairstyles that are pulling so much on your edges, like big braids, even low sleek buns pull your front hair which will eventually damage your edges. Be as least manipulative with your edges as you can, and this can include things like resisting to lay your edges every single time. Gurrrl, just let your edges breathe! You can style your natural hair in a way that your edges are covered so you don't have to touch them. See you in my next post" 
    },
    {
        "id": "4",
        "userId": "3",
        "body": "Did you know your hair growns half an inch every month? There is no such thing as stunted growth when it comes to the hair. Your hair is in a constant state of growth and renewal. So why does you hair looks like it's stagnated? I'm choosing my words carefully, so I said 'looks like it's stagnated', because it's not, it's sth you are doing wrong. Have I aroused your curiosity? Follow me along this journey as I help you uncover what you don't know."
    }
]