[
  {
    "title": "Teriyaki tofu",
    "author": "Danny Burrow",
    "ingredients": ["firm tofu", "teriyaki sauce", "cornflour", "frying oil"],
    "instructions": "Press excess water from tofu. Cut into bite-size pieces. Dredge in cornflour. Deep fry. Drain excess oil, then coat in teriyaki sauce. Serve over rice."
  },
  {
    "title": "BBQ Pulled Pork",
    "author": "Danny Burrow",
    "ingredients": ["whole pork shoulder", "bbq spice mix"],
    "instructions": "Pat pork shoulder dry and liberally coat with salt and spices. Place on a rack in oven at 225F for 8-12 hours, until roast is fall-apart tender. Cool slightly, then shred. Mix with skimmed and strained pan drippings as desired. "
  },
  {
    "title": "Chicken Pizza",
    "author": "Matilda Njau",
    "ingredients": ["all-purpose flour", "instant yeast", "sugar", "salt", "warm water", "olive oil", "pizza sauce", "garlic sauce", "cooked shredded chicken", "diced ham", "sliced red onion", "sliced red and yellow bell peppers", "shredded mozzarella cheese", "red pepper flakes", "grated parmesan cheese"],
    "instructions": "In a large bowl, combine all-purpose flour, instant yeast, sugar, and salt. Add warm water and olive oil. Mix until a dough forms. Knead for about 5-7 minutes until smooth and elastic. Place in an oiled bowl, cover, and let rise for 1 hour or until doubled. Preheat your oven to 475°F (245°C). Punch down the risen dough and roll it out on a floured surface to about 1/4 inch thick. Transfer to a pizza stone or a baking sheet lined with parchment paper. Evenly spread the pizza sauce over the dough. Drizzle with the garlic sauce for extra flavor. Layer the shredded chicken, diced ham, sliced red onion, and sliced bell peppers. Sprinkle the shredded mozzarella cheese and the grated parmesan cheese. Sprinkle with the red pepper flakes. Bake in the preheated oven for 12-15 minutes or until the crust is golden and the cheese is bubbly and slightly browned. Remove from the oven, let cool for a few minutes, slice, and serve warm. Feel free to adjust the toppings and sauces according to your taste!" 
  }
]
